<?php

namespace Database\Seeders;

use App\Models\Country;
use App\Models\CountryTrans;
use App\Models\District;
use App\Models\DistrictTrans;
use App\Models\Province;
use App\Models\ProvinceTrans;
use App\Models\Translate;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class CountrySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $country = [
            "Afghanistan" => [
                "fa" => "افغانستان",
                "ps" => "افغانستان",
                "provinces" => [
                    "Kabul" => [
                        "fa" => "کابل",
                        "ps" => "کابل",
                        "District" => [
                            "Paghman" => ["fa" => "پغمان", "ps" => "پغمان"],
                            "Shakardara" => ["fa" => "شکردره", "ps" => "شکردره"],
                            "Kabul" => ["fa" => "کابل", "ps" => "کابل"],
                            "Chahar Asyab" => ["fa" => "چهاراسیاب", "ps" => "څلور اسیاب"],
                            "Surobi" => ["fa" => "سرابی", "ps" => "سرابی"],
                            "Bagrami" => ["fa" => "بگرام", "ps" => "بگرام"],
                            "Deh Sabz" => ["fa" => "دِه‌سبز", "ps" => "دِه‌سبز"],
                            "Farza" => ["fa" => "فَرزه", "ps" => "فَرزه"],
                            "Guldara" => ["fa" => "گُلدره", "ps" => "گُلدره"],
                            "Istalif" => ["fa" => "اِستالِف", "ps" => "اِستالِف"],
                            "Kalakan" => ["fa" => "کَلَکان", "ps" => "کَلَکان"],
                            "Khaki Jabbar" => ["fa" => "خاکِ جبار", "ps" => "خاکِ جبار"],
                            "Mir Bacha Kot" => ["fa" => "میربچه‌کوت ", "ps" => "مېربچه کوټ"],
                            "Mussahi" => ["fa" => "موسهی ", "ps" => " موسهی"],
                            "Qarabagh" => ["fa" => "قره‌باغ ", "ps" => " قره‌باغ"],


                        ]
                    ],
                    "Herat" => [
                        "fa" => "هرات",
                        "ps" => "هرات",
                        "District" => [
                            "Herat" => ["fa" => "هرات", "ps" => "هرات"],
                            "Ghorian" => ["fa" => "غوریان", "ps" => "غوریان"],
                            "Shindand" => ["fa" => "شندند", "ps" => "شندند"],
                            "Karukh" => ["fa" => "کرخ", "ps" => "کرخ"],
                            "Pashtun Zarghun" => ["fa" => "پشتون زرغون", "ps" => "پشتون زرغون"],
                            "Gulran" => ["fa" => "گلران", "ps" => "گلران"],
                            "Chishti Sharif" => ["fa" => "چِشت شریف", "ps" => "چِشت شریف"],
                            "Farsi" => ["fa" => "فارسی", "ps" => "فارسی"],
                            "Guzara" => ["fa" => "گُذَره", "ps" => "گُذَره"],
                            "Enjil" => ["fa" => "اِنجیل", "ps" => "اِنجیل"],
                            "Kohsan" => ["fa" => "کُهسان", "ps" => "کُهسان"],
                            "Kushk" => ["fa" => "کُشک", "ps" => "کُشک"],
                            "Kushki Kuhna" => ["fa" => "کُشک کهنه", "ps" => "کُشک کهنه"],
                            "Obe" => ["fa" => "اوبه", "ps" => "اوبه"],
                            "Zinda Jan" => ["fa" => "زنده‌جان", "ps" => "زنده‌جان"],


                        ]
                    ],



                    "Balkh" => [
                        "fa" => "بلخ",
                        "ps" => "بلخ",
                        "District" => [
                            "Mazar-e Sharif" => ["fa" => "مزار شریف", "ps" => "مزار شریف"],
                            "Chahar Kint" => ["fa" => "چهارکنت", "ps" => "څلورکنت"],
                            "Sholgara" => ["fa" => "شولگره", "ps" => "شولگره"],
                            "Zari" => ["fa" => "زاری", "ps" => "زاری"],
                            "Charbolak" => ["fa" => "چارپولَک", "ps" => "چارپولَک"],
                            "Chimtal" => ["fa" => "چَمتال", "ps" => "چَمتال"],
                            "Dawlatabad" => ["fa" => "دولت‌آباد", "ps" => "دولت‌آباد"],
                            "Dihdadi" => ["fa" => "دِهدادی", "ps" => "دِهدادی"],
                            "Kaldar" => ["fa" => "کُلدار", "ps" => "کُلدار"],
                            "Khulm" => ["fa" => "خَلَم", "ps" => "خَلَم"],
                            "Kishindih" => ["fa" => "کَشنده", "ps" => "کَشنده"],
                            "Nahri Shahi" => ["fa" => "نهر شاهی", "ps" => "نهر شاهی"],
                            "Sholgara" => ["fa" => "شولگره", "ps" => "شولگره"],
                            "Shortepa" => ["fa" => "شورتپه", "ps" => "شورتپه"],
                            "Marmul" => ["fa" => "مارمَل", "ps" => "مارمَل"],


                        ]
                    ],
                    "Kandahar" => [
                        "fa" => "کندهار",
                        "ps" => "کندهار",
                        "District" => [
                            "Kandahar" => ["fa" => "کندهار", "ps" => "کندهار"],
                            "Dand" => ["fa" => "دند", "ps" => "دند"],
                            "Panjwayi" => ["fa" => "پنجوایی", "ps" => "پنجوایی"],
                            "Shah Wali Kot" => ["fa" => "شاه ولیکوت", "ps" => "شاه ولیکوت"],
                            "Arghandab" => ["fa" => "ارغنداب", "ps" => "ارغنداب"],
                            "Arghistan" => ["fa" => "اَرغستان", "ps" => "اَرغستان"],
                            "Daman" => ["fa" => "دامان", "ps" => "ژړی"],
                            "Ghorak" => ["fa" => "غورَک", "ps" => "غورَک"],
                            "Khakrez" => ["fa" => "خاکریز", "ps" => "خاکریز"],
                            "Maruf" => ["fa" => "معروف", "ps" => "معروف"],
                            "Maiwand" => ["fa" => "مَیوَند", "ps" => "مَیوَند"],
                            "Miyanishin" => ["fa" => "میانَشین", "ps" => "میانَشین"],
                            "Reg" => ["fa" => "ریگستان", "ps" => "ریگستان"],
                            "Shorabak" => ["fa" => "شورابَک", "ps" => "شورابَک"],
                            "Spin Boldak" => ["fa" => "سپین‌بولدَک", "ps" => "سپین‌بولدَک"],


                        ]
                    ],
                    "Nangarhar" => [
                        "fa" => "ننگرهار",
                        "ps" => "ننګرهار",
                        "District" => [
                            "Jalalabad" => ["fa" => "جلال آباد", "ps" => "جلال آباد"],
                            "Behsood" => ["fa" => "بهسود", "ps" => "بهسود"],
                            "Surkh Rod" => ["fa" => "سرخ رود", "ps" => "سرخ رود"],
                            "Nazi Bagh" => ["fa" => "نازی باغ", "ps" => "نازی باغ"],
                            "Khogiyani" => ["fa" => "خوگیانی", "ps" => "خوگیانی"],
                            "Deh Bala" => ["fa" => "ده‌بالا", "ps" => "ده‌بالا"],
                            "Shinwar" => ["fa" => "شینوار", "ps" => "شینوار"],
                            "Achin" => ["fa" => "اَچین", "ps" => "اَچین"],
                            "Chaparhar" => ["fa" => "چَپَرهار", "ps" => "چَپَرهار"],
                            "Darai Nur" => ["fa" => "درهٔ نور", "ps" => "درهٔ نور"],
                            "Bati Kot" => ["fa" => "بَتی‌کوت", "ps" => "بَتی‌کوت"],
                            "Dur Baba" => ["fa" => "دَربابا", "ps" => "دَربابا"],
                            "Goshta" => ["fa" => "گوشته", "ps" => "گوشته"],
                            "Hisarak" => ["fa" => "حصارک", "ps" => "حصارک"],
                            "Kama" => ["fa" => "کامه", "ps" => "کامه"],
                            "Khogyani" => ["fa" => "خوگیانی", "ps" => "خوگیانی"],
                            "Kot" => ["fa" => "کوت", "ps" => "کوت"],
                            "Kuz Kunar" => ["fa" => "کوزکُنر", "ps" => "کوزکُنر"],
                            "Lal Pur" => ["fa" => "لعل‌پور", "ps" => "لعل‌پور"],
                            "Momand Dara" => ["fa" => "مُهمنددره", "ps" => "مُهمنددره"],
                            "Nazyan" => ["fa" => "نازیان", "ps" => "نازیان"],
                            "Pachir Aw Agam" => ["fa" => "پَچیرواَگام", "ps" => "پَچیرواَگام"],
                            "Rodat" => ["fa" => "رودات", "ps" => "رودات"],
                            "Sherzad" => ["fa" => "شیرزاد", "ps" => "شیرزاد"],
                            "Surkh Rod" => ["fa" => "سرخ‌رود", "ps" => "سرخ‌رود"],



                        ]
                    ],
                    "Logar" => [
                        "fa" => "لوگر",
                        "ps" => "لوګر",
                        "District" => [
                            "Pul-e Alam" => ["fa" => "پُل علم", "ps" => "پُل علم"],
                            "Kharwar" => ["fa" => "خرور", "ps" => "خرور"],
                            "Mohammad Agha" => ["fa" => "محمد آغی", "ps" => "محمد آغی"],
                            "Baraki Barak" => ["fa" => "برکی برک", "ps" => "برکی برک"],
                            "Charkh" => ["fa" => "چَرخ ", "ps" => " څرخ"],
                            "Khoshi" => ["fa" => " خوشی", "ps" => " خوښی"],
                            "Azra" => ["fa" => "ازره  ", "ps" => " اَزره"],
                        ]
                    ],
                    "Ghazni" => [
                        "fa" => "غزنی",
                        "ps" => "غزنی",
                        "District" => [
                            "Ghazni" => ["fa" => "غزنی", "ps" => "غزنی"],
                            "Jaghori" => ["fa" => "جاغوری", "ps" => "جاغوری"],
                            "Qarabagh" => ["fa" => "قره باغ", "ps" => "قره باغ"],
                            "Ab Band" => ["fa" => "آب بند", "ps" => "آب بند"],
                            "Ajristan" => ["fa" => "اجرستان", "ps" => "اَجرستان"],
                            "Andar" => ["fa" => "اَندَر", "ps" => "اندړ"],
                            "Deh Yak" => ["fa" => "ده یک", "ps" => "ده‌یک"],
                            "Gelan" => ["fa" => "گېلان", "ps" => "گیلان"],
                            "Giro" => ["fa" => "گیرو", "ps" => "گېرو"],
                            "Jaghatū" => ["fa" => "جَغَتو", "ps" => "جغتو"],
                            "Khogyani" => ["fa" => "خوگیانی
                                ", "ps" => "خوگیاڼی "],
                            "Khwaja Umari" => ["fa" => "خواجه‌عُمری", "ps" => "خواجه عمري"],
                            "Malistan" => ["fa" => "مالستان", "ps" => "مالستان"],
                            "Muqur" => ["fa" => "مقر", "ps" => "مقر"],
                            "Nawa" => ["fa" => "ناوه", "ps" => "ناوه"],
                            "Nawur" => ["fa" => "ناور", "ps" => "ناور"],
                            "Rashidan" => ["fa" => "رشیدان", "ps" => "راشیدان"],
                            "Waghaz" => ["fa" => "وغاز", "ps" => "وغاز"],
                            "Zana Khan" => ["fa" => "زنه خان", "ps" => "زنه‌خان"],
                        ]
                    ],
                    "Badakhshan" => [
                        "fa" => "بدخشان",
                        "ps" => "بدخشان",
                        "District" => [
                            "Faizabad" => ["fa" => "فیض آباد", "ps" => "فیض آباد"],
                            "Yawan" => ["fa" => "یوان", "ps" => "یوان"],
                            "Khwahan" => ["fa" => "خوایان", "ps" => "خوایان"],
                            "Shahriyir" => ["fa" => "شاه رییر", "ps" => "شاه رییر"],
                            "Arghanj Khwa" => ["fa" => "ارغنجخواه ", "ps" => "اَرغَنج‌خواه"],
                            "Argo" => ["fa" => "اَرگو", "ps" => "ارگو "],
                            "Baharak" => ["fa" => "بهارک", "ps" => "بهارک"],
                            "Darayim" => ["fa" => "درایم", "ps" => "درایم"],
                            "Ishkashim" => ["fa" => "اِشکاشِم", "ps" => "اشکاشم"],
                            "Jurm" => ["fa" => "جُرم", "ps" => "جورم"],
                            "Kishim" => ["fa" => "کِشِم", "ps" => "کشم"],
                            "Kohistan" => ["fa" => "کوهستان", "ps" => "کوهستان"],
                            "Kuf Ab" => ["fa" => "کوف‌آب", "ps" => "کوف آب "],
                            "Keran wa Menjan" => ["fa" => "کُران و مُنجان", "ps" => "کوران و منجان"],
                            "Raghistan" => ["fa" => "راغستان", "ps" => "راغستان"],
                            "Shahri Buzurg" => ["fa" => "شهر بزرگ", "ps" => "شهربزرگ"],
                            "Sheghnan" => ["fa" => "شِغنان", "ps" => "شغنان"],
                            "Shekay" => ["fa" => "شِکی", "ps" => "شېکي"],
                            "Shuhada" => ["fa" => "شهدا ", "ps" => "شهدا "],
                            "Tagab	" => ["fa" => "تگاب ", "ps" => "تگاب "],
                            "Tishkan" => ["fa" => "تیشکان", "ps" => "تېشکان"],
                            "Wakhan" => ["fa" => "واخان", "ps" => "واخان"],
                            "Warduj" => ["fa" => "وَردوج", "ps" => "وردوج"],
                            "Yaftali Sufla" => ["fa" => "یفتلِ پایین", "ps" => "یفتال سفله"],
                            "Yamgan" => ["fa" => "یَمَگان", "ps" => "یمگان "],
                            "Zebak" => ["fa" => "زیباک", "ps" => "زېباک"],
                        ]
                    ],
                    "Bamyan" => [
                        "fa" => "بامیان",
                        "ps" => "بامیان",
                        "District" => [
                            "Bamyan" => ["fa" => "بامیان", "ps" => "بامیان"],
                            "Waras" => ["fa" => "وراز", "ps" => "وراز"],
                            "Saighan" => ["fa" => "سایغان", "ps" => "سایغان"],
                            "Kahmard" => ["fa" => "کَهمَرد", "ps" => "کهمرد "],
                            "Panjab" => ["fa" => "پنجاب", "ps" => "پنجآب"],
                            "Sayghan" => ["fa" => "سَیغان", "ps" => "سيغان "],
                            "Shibar" => ["fa" => "شیبَر", "ps" => "شیبَر"],
                            "Waras" => ["fa" => "وَرَس", "ps" => "ورس"],
                            "Yakawlang" => ["fa" => "یکاولنگ", "ps" => "يکاولنگ"],
                        ]
                    ],
                    "Samangan" => [
                        "fa" => "سمنگان",
                        "ps" => "سمنگان",
                        "District" => [
                            "Aybak" => ["fa" => "ایبک", "ps" => "ایبک"],
                            "Kohistan" => ["fa" => "کوهستان", "ps" => "کوهستان"],
                            "Dahana-i-Ghori" => ["fa" => "دهن غوری", "ps" => "دهن غوری"],
                            "Darah Sof Balla" => ["fa" => "دره صوف بالا", "ps" => "دره صوفي بالا"],
                            "Darah Sof Payan" => ["fa" => "دره صوف پایین", "ps" => "دره صوفي پایان "],
                            "Feroz Nakhchir	" => ["fa" => "فیروزنَخچیر", "ps" => "فیروز نخچر"],
                            "Hazrat Sultan" => ["fa" => "حضرتِ سلطان", "ps" => "حضرت سلطان"],
                            "Khuram Wa Sarbagh" => ["fa" => "خُرم و سارباغ", "ps" => "خرم او سرباغ"],
                            "Ruyi Du Ab" => ["fa" => "روی دوآب", "ps" => "روی دو آب"],


                        ]
                    ],
                    "Takhar" => [
                        "fa" => "تخار",
                        "ps" => "تخار",
                        "District" => [
                            "Taloqan" => ["fa" => "تالقان", "ps" => "تالقان"],
                            "Dasht Qala" => ["fa" => "داشتی قلعه", "ps" => "داشتی قلعه"],
                            "Yangi Qala" => ["fa" => "یونی قلعه", "ps" => "یونی قلعه"],
                            "Baharak" => ["fa" => "بهارک", "ps" => "بهارک"],
                            "Bangi" => ["fa" => "بَنگی", "ps" => "بنگي"],
                            "Chah Ab" => ["fa" => "چاه‌آب", "ps" => "چاه آب"],
                            "Darqad" => ["fa" => "دَرقَد", "ps" => "درقد"],
                            "Dashti Qala" => ["fa" => "یَنگی‌قلعه", "ps" => "ینگي کلا"],
                            "Farkhar" => ["fa" => "فَرخار", "ps" => "فرخار"],
                            "Hazar Sumuch" => ["fa" => "هزارسَموچ", "ps" => "هزار سموچ"],
                            "Ishkamish" => ["fa" => "اِشکمِش", "ps" => "اشکامش"],
                            "Kalafgan" => ["fa" => "کلفگان", "ps" => "کلفگان"],
                            "Khwaja Bahauddin" => ["fa" => "خواجه بهاوالدین", "ps" => "خواجه بهاوالدین"],
                            "Khwaja Ghar" => ["fa" => "خواجه غار", "ps" => "خواجه غر"],
                            "Namak Ab" => ["fa" => "نمک‌آب", "ps" => "نمک آب"],
                            "Rustaq" => ["fa" => "روستاق", "ps" => "رستاق"],
                            "Warsaj" => ["fa" => "ورساج", "ps" => "ورساج"],

                        ]
                    ],
                    "Paktia" => [
                        "fa" => "پکتیا",
                        "ps" => "پکتیا",
                        "District" => [
                            "Gardez" => ["fa" => "ګردیز", "ps" => "ګردیز"],
                            "Ahmad Aba" => ["fa" => "احمد آباد ", "ps" => "احمدآباد"],
                            "Laja Ahmad khel" => ["fa" => "لجه احمدخیل", "ps" => " لژه احمد خېل "],
                            "Dand Aw Patan" => ["fa" => "دَند پَتان", "ps" => "ډنډ او پټان"],
                            "Gerda Serai" => ["fa" => "گرده ثیری", "ps" => "گرده ثیری"],
                            "Janikhel District" => ["fa" => "جانی‌خیل", "ps" => "جانيخېل"],
                            "Mirzaka" => ["fa" => "میرزکه", "ps" => "میرزکه"],
                            "Rohani Baba" => ["fa" => "روحاني بابا", "ps" => "روحاني بابا"],
                            "Said Karam" => ["fa" => "سيد کرم", "ps" => "سيد کرم"],
                            "Shwak" => ["fa" => "شواک", "ps" => "شواک"],
                            "Chamkani" => ["fa" => "چَمکَنی", "ps" => "څمکنۍ"],
                            "Zadran" => ["fa" => "زَدران", "ps" => "ځدران"],
                            "Zazi " => ["fa" => "جاجی", "ps" => "ځاځي"],
                            "Zurmat" => ["fa" => "زرمت", "ps" => "زرمت"],


                        ]
                    ],
                    "Khost" => [
                        "fa" => "خوست",
                        "ps" => "خوست",
                        "District" => [
                            "Khost" => ["fa" => "خوست", "ps" => "خوست"],
                            "Mandozai" => ["fa" => "مندوزی", "ps" => "مندوزی"],
                            "Zazai Maidan" => ["fa" => "زازای میدان", "ps" => "زازای میدان"],
                            "Bak" => ["fa" => "باک", "ps" => "باک"],
                            "Gurbuz" => ["fa" => "گُربُز", "ps" => "گوربز"],
                            "Jaji Maydan" => ["fa" => "جاجی‌میدان", "ps" => "ځاځي میدان"],
                            "Musa Khel	" => ["fa" => "موسی‌خیل", "ps" => "موسی خېل"],
                            "Nadir Shah Kot" => ["fa" => "نادرشاه‌کوت", "ps" => "نادرشاه کوټ"],
                            "Qalandar" => ["fa" => "قَلَندر", "ps" => "قلندر"],
                            "Sabari" => ["fa" => "صَبری", "ps" => "سبري"],
                            "Shamal" => ["fa" => "شَمَل", "ps" => "شمال"],
                            "Spera" => ["fa" => "سپیره", "ps" => "سپېره"],
                            "Tani" => ["fa" => "تَنی", "ps" => "تڼۍ"],
                            "Tirazayi" => ["fa" => "تیریزائی", "ps" => "تېره زی"],
                        ]
                    ],
                    "Paktika" => [
                        "fa" => "پکتیکا",
                        "ps" => "پکتیکا",
                        "District" => [
                            "Sharan" => ["fa" => "شرن", "ps" => "شرن"],
                            "Sarobi" => ["fa" => "سروری", "ps" => "سروری"],
                            "Barmal" => ["fa" => "برمل", "ps" => "برمل"],
                            "Dila" => ["fa" => "دیله", "ps" => "ډیله"],
                            "Gayan" => ["fa" => "گیان", "ps" => "گیان"],
                            "Gomal" => ["fa" => "گومَل", "ps" => "گومال"],
                            "Janikhel" => ["fa" => "جانی‌خیل", "ps" => "جاني خېل"],
                            "Zarghun Shar " => ["fa" => "زرغون‌شهر", "ps" => "زرغون ښار"],
                            "Mata Khan" => ["fa" => "مَتاخان", "ps" => "مټاخان"],
                            "Nika" => ["fa" => "نکه", "ps" => "نېکه"],
                            "Omna" => ["fa" => "اومَنه", "ps" => "اومنا"],
                            "Sar Hawza" => ["fa" => "سرروضه", "ps" => "سر حوزه"],
                            "Surobi" => ["fa" => "سَروبی", "ps" => "سروبي"],
                            "Terwa" => ["fa" => "تَروُو", "ps" => "تېروه"],
                            "Urgun" => ["fa" => "اُرگون", "ps" => "ارگون"],
                            "Wazakhwa" => ["fa" => "وازه‌خواه", "ps" => "وازه خوا"],
                            "Wor Mamay" => ["fa" => "وَرمَمی", "ps" => "ور مامی"],
                            "Yahyakhel" => ["fa" => "یخیی خېل ", "ps" => "یخیی خېل "],
                            "Yusufkhel" => ["fa" => "یوسف خېل ", "ps" => "یوسف خېل "],
                            "Zerok" => ["fa" => "زیروک", "ps" => "زیروک"],







                        ]
                    ],
                    "Nimroz" => [
                        "fa" => "نمروز",
                        "ps" => "نمروز",
                        "District" => [
                            "Zaranj" => ["fa" => "زرنج", "ps" => "زرنج"],
                            "Khash Rod" => ["fa" => "خرش رود", "ps" => "خرش رود"],
                            "Chahar Burjak" => ["fa" => "چهاربُرجک", "ps" => "چاربورجک"],
                            "Chakhansur" => ["fa" => "چَخانسور", "ps" => "چخانسور"],
                            "Kang" => ["fa" => "کَنگ", "ps" => "کنگ"],

                        ]
                    ],
                    "Urozgan" => [
                        "fa" => "اُروزگان",
                        "ps" => "اُروزگان",
                        "District" => [
                            "Tarin Kot" => ["fa" => " ترین‌کوت", "ps" => "ترین کوټ"],
                            "Deh Rawud" => ["fa" => "ده راود", "ps" => "ده راود"],
                            "Chora" => ["fa" => "چوره", "ps" => "چوره"],
                            "Khas Uruzgan" => ["fa" => "خاص‌ارزگان", "ps" => "خاص اروزگان"],
                            "Shahidi Hassas" => ["fa" => "شهید حساس", "ps" => "شهيدې حساس"],

                        ]
                    ],
                    "Daykundi" => [
                        "fa" => "دایکندی",
                        "ps" => "دایکندی",
                        "District" => [
                            "Nili" => ["fa" => "نیلی", "ps" => "نیلی"],
                            "Kiti" => ["fa" => "کتی", "ps" => "کتی"],
                            "Ishtarlay" => ["fa" => "اَشتَرَلی", "ps" => "اشتارلي"],
                            "Kajran" => ["fa" => "کِجران", "ps" => "کجران "],
                            "Khadir " => ["fa" => "خِدیر", "ps" => "خادر "],
                            "Miramor" => ["fa" => "میرامور", "ps" => "میرامور"],
                            "Sangtakht" => ["fa" => "سنگِ تخت", "ps" => "سنگ تخت"],
                            "Shahristan" => ["fa" => "شهرستان", "ps" => "شهرستان"],
                            "Patoo " => ["fa" => "پاتو", "ps" => "پاتو"],


                        ]
                    ],
                    "Badghis" => [
                        "fa" => "بدخشانی",
                        "ps" => "بدخشانی",
                        "District" => [
                            "Qala-i-Naw" => ["fa" => "قلعه نو", "ps" => "قلعه نو"],
                            "Murghab" => ["fa" => "مرغاب", "ps" => "مرغاب"],
                            "Jawand" => ["fa" => "جواند", "ps" => "جواند"],
                            "Ab Kamari " => ["fa" => "آب‌کَمَری", "ps" => "آبکمري"],
                            "Ghormach " => ["fa" => "غورماچ", "ps" => "غورماچ"],
                            "Muqur " => ["fa" => "مُقُر", "ps" => "مقر"],
                            "Bala Murghab " => ["fa" => "بالا مرغاب", "ps" => "بالا مرغاب"],
                            "Qadis " => ["fa" => "قادِس", "ps" => "قاديس"],

                        ]
                    ],
                    "Ghor" => [
                        "fa" => "غور",
                        "ps" => "غور",
                        "District" => [
                            "Chaghcharan" => ["fa" => "چغچران", "ps" => "چغچران"],
                            "Lal wa Sarjangal" => ["fa" => "لال و سرجنگل", "ps" => "لال و سرجنگل"],
                            "Marghab " => ["fa" => "مرغاب", "ps" => "مرغاب"],
                            "Charsada " => ["fa" => "چارسده", "ps" => "چارسده "],
                            "Dawlat Yar " => ["fa" => "دولت یار", "ps" => "دولت یار"],
                            "Du Layna " => ["fa" => "دولینه", "ps" => "دو لاینه"],
                            "Pasaband " => ["fa" => "پسابند", "ps" => "پسابند"],
                            "Saghar " => ["fa" => "ساغر", "ps" => "ساغر"],
                            "Shahrak " => ["fa" => "شهرک", "ps" => "شهرک"],
                            "Taywara " => ["fa" => "تیوره", "ps" => "تایواره"],
                            "Tulak " => ["fa" => "تولک", "ps" => "تولک"],
                        ]
                    ],
                    "Sar-e Pol" => [
                        "fa" => "سرپل",
                        "ps" => "سرپل",
                        "District" => [
                            "Sar-e Pol" => ["fa" => "سرپل", "ps" => "سرپل"],
                            "Kohistanat" => ["fa" => "کوهستانات", "ps" => "کوهستانات"],
                            "Balkhab" => ["fa" => "بلخاب", "ps" => "بلخاب"],
                            "Gosfandi" => ["fa" => "گوسفندی", "ps" => "گوسفندي "],
                            "Sangcharak" => ["fa" => "سانچارک", "ps" => "سنگچارک"],
                            "Sayyad" => ["fa" => "صیاد", "ps" => "سیاد"],
                            "Sozma Qala" => ["fa" => "سرپل", "ps" => "سوزمه کلا"],

                        ]
                    ],
                    "Faryab" => [
                        "fa" => "فاریاب",
                        "ps" => "فاریاب",
                        "District" => [
                            "Maymana" => ["fa" => "مینه", "ps" => "مینه"],
                            "Andkhoi" => ["fa" => "اندخوی", "ps" => "اندخوی"],
                            "Ghowchak" => ["fa" => "غوچک", "ps" => "غوچک"],
                            "Almar" => ["fa" => "اَلمار", "ps" => "الیمار"],
                            "Bilchiragh" => ["fa" => "بُلچراغ", "ps" => "بېلچراغ"],
                            "Dawlat Abad" => ["fa" => "دولت‌آباد", "ps" => "دولت اباد"],
                            "Gurziwan" => ["fa" => "گَرزیوان", "ps" => "گورزیوان"],
                            "Khani Chahar Bagh" => ["fa" => "خانه چارباغ", "ps" => "خانه چارباغ"],
                            "Khwaja Sabz Posh" => ["fa" => "خواجه سبزپوش ولی", "ps" => "خواجه سبز پوش"],
                            "Kohistan" => ["fa" => "کوهستان", "ps" => "کوهستان"],
                            "Pashtun Kot" => ["fa" => "پشتون‌کوت", "ps" => "پښتونکوټ"],
                            "Qaramqol" => ["fa" => "قَرَم‌قُل", "ps" => "قرمگل"],
                            "Qaysar" => ["fa" => "قیصار", "ps" => "قیصار"],
                            "Qurghan" => ["fa" => "قَرغان", "ps" => "قرغان"],
                            "Shirin Tagab" => ["fa" => "شیرین‌تَگاب", "ps" => "شیرین تگاب"],

                        ]
                    ],
                    "Panjshir" => [
                        "fa" => "پنجشیر",
                        "ps" => "پنجشیر",
                        "District" => [
                            "Bazarak" => ["fa" => "بازارک", "ps" => "بازارک"],
                            "Shahristan" => ["fa" => "شهریستان", "ps" => "شهریستان"],
                            "Anaba" => ["fa" => "اَنابه", "ps" => "انابه "],
                            "Darah " => ["fa" => "دره ", "ps" => "دره "],
                            "Khenj" => ["fa" => "خِنج", "ps" => "خنج"],
                            "Paryan" => ["fa" => "پریان", "ps" => "پریان"],
                            "Rokha" => ["fa" => "روخه", "ps" => "روخه "],
                            "Shotul" => ["fa" => "شُتُل", "ps" => "شوتل"],

                        ]
                    ],
                    "Parwan" => [
                        "fa" => "پروان",
                        "ps" => "پروان",
                        "District" => [
                            "Bagram" => ["fa" => "بَگرام", "ps" => "بَگرام"],
                            "Charikar" => ["fa" => "چاریکار", "ps" => "چاریکار"],
                            "Ghorband" => ["fa" => "غوربند", "ps" => "غوربند"],
                            "Jabul Saraj" => ["fa" => "جبل سراج", "ps" => "جبل‌سراج"],
                            "Kohi Safi" => ["fa" => "کوهِ صافی", "ps" => "کوه سافي"],
                            "Salang" => ["fa" => "سالَنگ", "ps" => "
                                سالنگ"],
                            "Sayed Khel " => ["fa" => "سیدخیل", "ps" => "سید خیل "],
                            "Sheikh Ali" => ["fa" => " شیخ علي", "ps" => " شیخ علي"],
                            "Shinwari" => ["fa" => "شینواری", "ps" => "شینواري"],
                            "Surkhi Parsa" => ["fa" => "سرخِ پارسا", "ps" => "سرخ پارسا"],



                        ]
                    ],

                    "Maidan Wardak" => [
                        "fa" => " میدان وردگ",
                        "ps" => " میدان وردگ",
                        "District" => [
                            "Chaki" => ["fa" => "چکِ وردک", "ps" => "چک"],
                            "Day Mirdad" => ["fa" => "دایمیرداد", "ps" => "دايمرداد"],
                            "Bihsud" => ["fa" => "بهسود", "ps" => "بهسود "],
                            "Jaghatu " => ["fa" => "جغتو ", "ps" => "جغتو "],
                            "Jalrez" => ["fa" => "جلریز", "ps" => "جلريز"],
                            "Markazi Bihsud" => ["fa" => "مرکزِ بهسود", "ps" => "مرکزي بهسود"],
                            "Maydan Shahr" => ["fa" => "میدان شار", "ps" => "ميدان ښار "],
                            "Nirkh" => ["fa" => "نِرخ", "ps" => "نرخ"],
                            "Saydabad" => ["fa" => "سیدآباد", "ps" => "سيد آباد"],

                        ]
                    ],

                    "Nuristan" => [
                        "fa" => "نورستان",
                        "ps" => "نورستان",
                        "District" => [
                            "Bargi Matal" => ["fa" => "برگِ مَتال", "ps" => "برگېمټال"],
                            "Du Ab" => ["fa" => "دوآب", "ps" => "دو آب "],
                            "Kamdesh" => ["fa" => "کامدیش", "ps" => "کامدېش "],
                            "Mandol " => ["fa" => "مَندول ", "ps" => "منډول "],
                            "Nurgaram " => ["fa" => "نورگرام ", "ps" => "نورگرام "],
                            "Parun" => ["fa" => "پارون", "ps" => "پارون"],
                            "Wama" => ["fa" => "واما", "ps" => "واما "],
                            "Waygal" => ["fa" => "وایگَل", "ps" => "وایگل"],

                        ]
                    ],

                    "Helmand " => [
                        "fa" => " هلمند",
                        "ps" => "هلمند",
                        "District" => [
                            "Baghran" => ["fa" => "بَغران", "ps" => "باغران"],
                            "Dishu" => ["fa" => "دیشو", "ps" => "دیشو"],
                            "Garmsir" => ["fa" => "گرمسیر", "ps" => "گرمسېر "],
                            "Grishk " => ["fa" => "گريشک ", "ps" => "گريشک "],
                            "Kajaki" => ["fa" => "کَجَکی", "ps" => "کجکي"],
                            "Khanashin" => ["fa" => "خان‌نشین", "ps" => "خانېشين"],
                            "Lashkargah" => ["fa" => "لشکرگاه", "ps" => "لښکرگاه "],
                            "Nad Ali" => ["fa" => "نادعلی", "ps" => "نادعلي"],
                            "Musa Qala" => ["fa" => "موسی‌قلعه", "ps" => "موسی کلا"],
                            "Nawa-I-Barakzayi" => ["fa" => "ناوهٔ بارکزائی", "ps" => "نوی بارکزی"],
                            "Nawzad" => ["fa" => "نوزاد", "ps" => "نوزاد"],
                            "Sangin" => ["fa" => "سَنگین", "ps" => "سنگین"],
                            "Washir" => ["fa" => "واشیر", "ps" => "واشېر"],


                        ]
                    ],

                    "Zabul" => [
                        "fa" => " زابل",
                        "ps" => "زابل",
                        "District" => [
                            "Argahandab" => ["fa" => "اَرغَنداب", "ps" => "ارغنداب"],
                            "Atghar" => ["fa" => "اَتغَر", "ps" => "اټغار"],
                            "Daychopan" => ["fa" => "دای چوپان", "ps" => "دای چوپان "],
                            "Kakar " => ["fa" => "کاکَر ", "ps" => "کاکړ "],
                            "Mezana" => ["fa" => "میزان", "ps" => "میزان"],
                            "Naw Bahar" => ["fa" => "نوبهار", "ps" => "نو بجر "],
                            "Qalat" => ["fa" => "قَلات", "ps" => "قلات "],
                            "Shamulzayi" => ["fa" => "شمولزی", "ps" => " شمولزی"],
                            " Shinkay" => ["fa" => "شینکی", "ps" => " شینکی"],
                            "Tarnak Wa Jaldak" => ["fa" => "ترنک او جلدک", "ps" => "ترنک او جلدک "],



                        ]
                    ],

                    "Farah " => [
                        "fa" => " فراه",
                        "ps" => "فراه",
                        "District" => [
                            "Anar Dara" => ["fa" => "انار دره", "ps" => "انار دره"],
                            "Bakwa" => ["fa" => "شهریستان", "ps" => "شهریستان"],
                            "Anaba" => ["fa" => "بَکواه", "ps" => "بکوا "],
                            "Bala Buluk " => ["fa" => "بالابلوک ", "ps" => "بالا بلوک "],
                            "Farah" => ["fa" => "فراه
                                ", "ps" => "فراه
                                "],
                            "Gulistan" => ["fa" => "گلستان", "ps" => "گلستان"],
                            "Khaki Safed" => ["fa" => "خاک سفېد", "ps" => "خاک سفېد "],
                            "Lash wa Juwayn" => ["fa" => "لاش و جُوَین", "ps" => "د لاش او جواین"],
                            "Pur Chaman" => ["fa" => "پرچمن", "ps" => "پر چمن"],
                            "Pusht Rod" => ["fa" => "پُشت‌رود", "ps" => "پشت رود"],
                            "Qala i Kah" => ["fa" => "قلعهٔ کاه", "ps" => "قلعه کاه"],
                            "Shib Koh" => ["fa" => "شیب‌کوه", "ps" => "شېب کوه"],

                        ]
                    ],

                    "Laghman " => [
                        "fa" => " لَغمان",
                        "ps" => " لَغمان",
                        "District" => [
                            "Alingar" => ["fa" => "علینگار", "ps" => "الینگار"],
                            "Alishing" => ["fa" => "علیشِنگ", "ps" => "الیشنگ"],
                            "Mihtarlam" => ["fa" => "مهترلام", "ps" => "مهترلام "],
                            "Dawlat Shah " => ["fa" => "دولت‌شاه ", "ps" => "دولتشاه "],
                            "Qarghayi" => ["fa" => "قرغیي", "ps" => "قرغیي"],


                        ]
                    ],

                    "Kunar" => [
                        "fa" => " کنړ",
                        "ps" => "کنړ",
                        "District" => [
                            "Asadabad" => ["fa" => "اسد اباد", "ps" => "اسد اباد"],
                            "Bar Kunar" => ["fa" => "بَرکُنر", "ps" => "بر کنړ"],
                            "Chapa Dara" => ["fa" => "چپه‌دره", "ps" => "چپه دره "],
                            "Chawkay " => ["fa" => "چوکی ", "ps" => "څوکۍ "],
                            "Dangam" => ["fa" => "دانگام", "ps" => "دانگام"],
                            "Dara-I-Pech" => ["fa" => "دره‌پیچ", "ps" => "پېچ دره"],
                            "Nurgal" => ["fa" => "نورگُل", "ps" => "نورگل "],
                            "Khas Kunar" => ["fa" => "خاص‌کُنر", "ps" => "خاص کنړ"],
                            "Marawara" => ["fa" => "مَرَوَره", "ps" => "مروره"],
                            "Narang Wa Badil" => ["fa" => "نَرَنگ", "ps" => "نرنگ و باډېل"],
                            "Nari" => ["fa" => "ناری", "ps" => "ناړۍ"],
                            "Shaigal" => ["fa" => "شیگل", "ps" => "شیگل "],
                            "Sirkanai " => ["fa" => "سرکانی", "ps" => "سرکاڼو"],
                            "Wata Pur " => ["fa" => "وَتَه‌پور", "ps" => "وټه پور"],


                        ]
                    ],

                    "Kapisa" => [
                        "fa" => " کاپيسا",
                        "ps" => "کاپيسا",
                        "District" => [
                            "Alasay" => ["fa" => "اَلِه‌سائی", "ps" => "آلاسای"],
                            "Hesa Awal Kohistan" => ["fa" => "حصهٔ اول کوهستان", "ps" => "حصه اول کوهستان"],
                            "Hesa Duwum Kohistan " => ["fa" => "حصه دوم کوهستان ", "ps" => "حصه دوم کوهستان  "],
                            "Koh Band " => ["fa" => "کوه‌بند ", "ps" => "کوه بند "],
                            "Mahmud Raqi" => ["fa" => "محمود راقی", "ps" => "محمود راقي"],
                            "Nijrab" => ["fa" => "نَجراب", "ps" => "نجراب"],
                            "Tagab" => ["fa" => "تَگاب", "ps" => "تګاب "],


                        ]
                    ],

                    "Jowzjan" => [
                        "fa" => " جوزجان",
                        "ps" => "جوزجان",
                        "District" => [
                            "Aqcha" => ["fa" => "آقچه", "ps" => "آقچه"],
                            "Darzab" => ["fa" => "دَرزاب", "ps" => "درزاب"],
                            "Fayzabad" => ["fa" => "فیض‌آباد", "ps" => "فیض آباد "],
                            "Khamyab " => ["fa" => "خمیاب ", "ps" => "خمیاب "],
                            "Khaniqa" => ["fa" => "خانقاه", "ps" => "خانیقا"],
                            "Khwaja Du Koh" => ["fa" => "خواجه دوکوه", "ps" => "خواجه دو کوه"],
                            "Mardyan" => ["fa" => "مَردیان", "ps" => "مردیان "],
                            "Mingajik" => ["fa" => "مِنگَجِک", "ps" => "مینگاجیک"],
                            "Qarqin" => ["fa" => "قَرقین", "ps" => "قرقین"],
                            "Qush Tepa" => ["fa" => "قوش‌تپه", "ps" => "قش تپه"],
                            "Shibirghan" => ["fa" => "شِبِرغان", "ps" => "شبرغان"],





                        ]
                    ],

                    "Kunduz " => [
                        "fa" => " کندوز ",
                        "ps" => "کندوز",
                        "District" => [
                            "Aliabad" => ["fa" => "علي آباد", "ps" => "علي آباد"],
                            "Archi" => ["fa" => "ارچي", "ps" => "ارچي"],
                            "Char Dara" => ["fa" => "چهاردره", "ps" => "چاردره "],
                            "Imam Sahib " => ["fa" => "امام‌صاحب ", "ps" => "امام صيب "],
                            "Khan Abad" => ["fa" => "خان‌آباد", "ps" => "خان آباد"],
                            "Kunduz" => ["fa" => "کندوز", "ps" => "کندوز"],
                            "Qalay-I-Zal" => ["fa" => "قلعهٔ‌ذال", "ps" => "قلا زال "],


                        ]
                    ],

                    "Baghlan " => [
                        "fa" => " بغلان",
                        "ps" => "بغلان",
                        "District" => [
                            "Andarab" => ["fa" => "اندراب", "ps" => "اندراب"],
                            "Baghlani Jadid" => ["fa" => "بغلان جدید", "ps" => "نوی بغلان "],
                            "Burka" => ["fa" => "برکه", "ps" => "برکه "],
                            "Dahana-e-Ghuri " => ["fa" => "دهنه غوری
                                ", "ps" => "دهنه غوري"],
                            "Dih Salah" => ["fa" => "ده صلاح", "ps" => "ده صالح"],
                            "Dushi" => ["fa" => "دوشی", "ps" => "دوشي"],
                            "Farang Wa Gharu" => ["fa" => "فرنگ و غرو", "ps" => "فرنگ او غارو "],
                            "Guzargahi Nur" => ["fa" => "گذرگاه نور", "ps" => "گذرگاه نور"],
                            "Khinjan" => ["fa" => "خنجان", "ps" => "خنجان "],
                            "Khost Wa Fereng" => ["fa" => "خوست و فرنگ", "ps" => "خوست او فرنگ "],
                            "Khwaja Hijran (Jalga)" => ["fa" => "خواجه هجرت (جلگه)", "ps" => "خواجه هجران "],
                            "Nahrin" => ["fa" => "نهرین", "ps" => "ناهرين "],
                            "Puli Hisar" => ["fa" => "پل حصار", "ps" => "پل حصار "],
                            "Puli Khumri" => ["fa" => "	پل خمری", "ps" => "پلخمري "],
                            "Tala wa Barfak" => ["fa" => "روخه", "ps" => "تاله او برفک "],



                        ]
                    ],


                ]
            ],
            "Albania" => [
                "fa" => "آلبانی",
                "ps" => "آلبانی",
            ],
            "Algeria" => [
                "fa" => "الجزایر",
                "ps" => "الجزایر",
            ],
            "Andorra" => [
                "fa" => "اندورا",
                "ps" => "اندورا",
            ],
            "Angola" => [
                "fa" => "انگولا",
                "ps" => "انگولا",
            ],
            "Argentina" => [
                "fa" => "آرژانتین",
                "ps" => "آرژانتین",
            ],
            "Armenia" => [
                "fa" => "ارمنستان",
                "ps" => "ارمنستان",
            ],
            "Australia" => [
                "fa" => "استرالیا",
                "ps" => "استرالیا",
            ],
            "Austria" => [
                "fa" => "اتریش",
                "ps" => "اتریش",
            ],
            "Azerbaijan" => [
                "fa" => "آذربایجان",
                "ps" => "آذربایجان",
            ],
            "Bahamas" => [
                "fa" => "باهاماس",
                "ps" => "باهاماس",
            ],
            "Bahrain" => [
                "fa" => "بحرین",
                "ps" => "بحرین",
            ],
            "Bangladesh" => [
                "fa" => "بنگلادش",
                "ps" => "بنگلادش",
            ],
            "Barbados" => [
                "fa" => "باربادوس",
                "ps" => "باربادوس",
            ],
            "Belarus" => [
                "fa" => "بلاروس",
                "ps" => "بلاروس",
            ],
            "Belgium" => [
                "fa" => "بلژیک",
                "ps" => "بلژیک",
            ],
            "Belize" => [
                "fa" => "بلیز",
                "ps" => "بلیز",
            ],
            "Benin" => [
                "fa" => "بنین",
                "ps" => "بنین",
            ],
            "Bhutan" => [
                "fa" => "بوتان",
                "ps" => "بوتان",
            ],
            "Bolivia" => [
                "fa" => "بولیوی",
                "ps" => "بولیوی",
            ],
            "Bosnia and Herzegovina" => [
                "fa" => "بوسنی و هرزگوین",
                "ps" => "بوسنی و هرزگوین",
            ],
            "Botswana" => [
                "fa" => "بوتسوانا",
                "ps" => "بوتسوانا",
            ],
            "Brazil" => [
                "fa" => "برازیل",
                "ps" => "برازیل",
            ],
            "Brunei" => [
                "fa" => "برونئی",
                "ps" => "برونئی",
            ],
            "Bulgaria" => [
                "fa" => "بلغاریا",
                "ps" => "بلغاریا",
            ],
            "Burkina Faso" => [
                "fa" => "بورکینافاسو",
                "ps" => "بورکینافاسو",
            ],
            "Burundi" => [
                "fa" => "بوروندی",
                "ps" => "بوروندی",
            ],
            "Cabo Verde" => [
                "fa" => "کابو وردی",
                "ps" => "کابو وردی",
            ],
            "Cambodia" => [
                "fa" => "کامبوج",
                "ps" => "کامبوج",
            ],
            "Cameroon" => [
                "fa" => "کامرون",
                "ps" => "کامرون",
            ],
            "Canada" => [
                "fa" => "کانادا",
                "ps" => "کانادا",
            ],
            "Central African Republic" => [
                "fa" => "جمهوری آفریقای مرکزی",
                "ps" => "جمهوری آفریقای مرکزی",
            ],
            "Chad" => [
                "fa" => "چاد",
                "ps" => "چاد",
            ],
            "Chile" => [
                "fa" => "شیلی",
                "ps" => "شیلی",
            ],
            "China" => [
                "fa" => "چین",
                "ps" => "چین",
            ],
            "Colombia" => [
                "fa" => "کلمبیا",
                "ps" => "کلمبیا",
            ],
            "Comoros" => [
                "fa" => "کومور",
                "ps" => "کومور",
            ],
            "Congo, Democratic Republic of the" => [
                "fa" => "جمهوری دموکراتیک کنگو",
                "ps" => "جمهوری دموکراتیک کنگو",
            ],
            "Congo, Republic of the" => [
                "fa" => "جمهوری کنگو",
                "ps" => "جمهوری کنگو",
            ],
            "Costa Rica" => [
                "fa" => "کاستاریکا",
                "ps" => "کاستاریکا",
            ],
            "Croatia" => [
                "fa" => "کرواسی",
                "ps" => "کرواسی",
            ],
            "Cuba" => [
                "fa" => "کیوبا",
                "ps" => "کیوبا",
            ],
            "Cyprus" => [
                "fa" => "قبرس",
                "ps" => "قبرس",
            ],
            "Czech Republic" => [
                "fa" => "جمهوری چک",
                "ps" => "جمهوری چک",
            ],
            "Denmark" => [
                "fa" => "دانمارک",
                "ps" => "دانمارک",
            ],
            "Djibouti" => [
                "fa" => "جیبوتی",
                "ps" => "جیبوتی",
            ],
            "Dominica" => [
                "fa" => "دومینیکا",
                "ps" => "دومینیکا",
            ],
            "Dominican Republic" => [
                "fa" => "جمهوری دومینیکن",
                "ps" => "جمهوری دومینیکن",
            ],
            "Ecuador" => [
                "fa" => "اکوادور",
                "ps" => "اکوادور",
            ],
            "Egypt" => [
                "fa" => "مصر",
                "ps" => "مصر",
            ],
            "El Salvador" => [
                "fa" => "السالوادور",
                "ps" => "السالوادور",
            ],
            "Equatorial Guinea" => [
                "fa" => "گینه استوایی",
                "ps" => "گینه استوایی",
            ],
            "Eritrea" => [
                "fa" => "اریتره",
                "ps" => "اریتره",
            ],
            "Estonia" => [
                "fa" => "استونی",
                "ps" => "استونی",
            ],
            "Eswatini" => [
                "fa" => "اسواتینی",
                "ps" => "اسواتینی",
            ],
            "Ethiopia" => [
                "fa" => "اتیوپی",
                "ps" => "اتیوپی",
            ],
            "Fiji" => [
                "fa" => "فیجی",
                "ps" => "فیجی",
            ],
            "Finland" => [
                "fa" => "فنلند",
                "ps" => "فنلند",
            ],
            "France" => [
                "fa" => "فرانسه",
                "ps" => "فرانسه",
            ],
            "Gabon" => [
                "fa" => "گابن",
                "ps" => "گابن",
            ],
            "Gambia" => [
                "fa" => "گامبیا",
                "ps" => "گامبیا",
            ],
            "Georgia" => [
                "fa" => "گرجستان",
                "ps" => "گرجستان",
            ],
            "Germany" => [
                "fa" => "جرمنی",
                "ps" => "جرمنی",
            ],
            "Ghana" => [
                "fa" => "غنا",
                "ps" => "غنا",
            ],
            "Greece" => [
                "fa" => "یونان",
                "ps" => "یونان",
            ],
            "Grenada" => [
                "fa" => "گرانادا",
                "ps" => "گرانادا",
            ],
            "Guatemala" => [
                "fa" => "گواتمالا",
                "ps" => "گواتمالا",
            ],
            "Guinea" => [
                "fa" => "گینه",
                "ps" => "گینه",
            ],
            "Guinea-Bissau" => [
                "fa" => "گینه بیسائو",
                "ps" => "گینه بیسائو",
            ],
            "Guyana" => [
                "fa" => "گویانا",
                "ps" => "گویانا",
            ],
            "Haiti" => [
                "fa" => "هائیتی",
                "ps" => "هائیتی",
            ],
            "Honduras" => [
                "fa" => "هندوراس",
                "ps" => "هندوراس",
            ],
            "Hungary" => [
                "fa" => "مجارستان",
                "ps" => "مجارستان",
            ],
            "Iceland" => [
                "fa" => "ایسلند",
                "ps" => "ایسلند",
            ],
            "India" => [
                "fa" => "هند",
                "ps" => "هند",
            ],
            "Indonesia" => [
                "fa" => "اندونزی",
                "ps" => "اندونزی",
            ],
            "Iran" => [
                "fa" => "ایران",
                "ps" => "ایران",
            ],
            "Iraq" => [
                "fa" => "عراق",
                "ps" => "عراق",
            ],
            "Ireland" => [
                "fa" => "ایرلند",
                "ps" => "ایرلند",
            ],
            "Israel" => [
                "fa" => "اسرائیل",
                "ps" => "اسرائیل",
            ],
            "Italy" => [
                "fa" => "ایتالیا",
                "ps" => "ایتالیا",
            ],
            "Jamaica" => [
                "fa" => "جامائیکا",
                "ps" => "جامائیکا",
            ],
            "Japan" => [
                "fa" => "جاپان",
                "ps" => "جاپان",
            ],
            "Jordan" => [
                "fa" => "اردن",
                "ps" => "اردن",
            ],
            "Kazakhstan" => [
                "fa" => "قزاقستان",
                "ps" => "قزاقستان",
            ],
            "Kenya" => [
                "fa" => "کنیا",
                "ps" => "کنیا",
            ],
            "Kiribati" => [
                "fa" => "کیریباتی",
                "ps" => "کیریباتی",
            ],
            "Kuwait" => [
                "fa" => "کویت",
                "ps" => "کویت",
            ],
            "Kyrgyzstan" => [
                "fa" => "قرقیزستان",
                "ps" => "قرقیزستان",
            ],
            "Laos" => [
                "fa" => "لاوس",
                "ps" => "لاوس",
            ],
            "Latvia" => [
                "fa" => "لتونی",
                "ps" => "لتونی",
            ],
            "Lebanon" => [
                "fa" => "لبنان",
                "ps" => "لبنان",
            ],
            "Lesotho" => [
                "fa" => "لسوتو",
                "ps" => "لسوتو",
            ],
            "Liberia" => [
                "fa" => "لیبریا",
                "ps" => "لیبریا",
            ],
            "Libya" => [
                "fa" => "لیبیا",
                "ps" => "لیبیا",
            ],
            "Liechtenstein" => [
                "fa" => "لیختن‌اشتاین",
                "ps" => "لیختن‌اشتاین",
            ],
            "Lithuania" => [
                "fa" => "لیتوانی",
                "ps" => "لیتوانی",
            ],
            "Luxembourg" => [
                "fa" => "لوکزامبورگ",
                "ps" => "لوکزامبورگ",
            ],
            "Madagascar" => [
                "fa" => "ماداگاسکار",
                "ps" => "ماداگاسکار",
            ],
            "Malawi" => [
                "fa" => "مالاوی",
                "ps" => "مالاوی",
            ],
            "Malaysia" => [
                "fa" => "مالزی",
                "ps" => "مالزی",
            ],
            "Maldives" => [
                "fa" => "مالدیو",
                "ps" => "مالدیو",
            ],
            "Mali" => [
                "fa" => "مالی",
                "ps" => "مالی",
            ],
            "Malta" => [
                "fa" => "مالت",
                "ps" => "مالت",
            ],
            "Marshall Islands" => [
                "fa" => "جزایر مارشال",
                "ps" => "جزایر مارشال",
            ],
            "Mauritania" => [
                "fa" => "موریطانی",
                "ps" => "موریطانی",
            ],
            "Mauritius" => [
                "fa" => "موریس",
                "ps" => "موریس",
            ],
            "Mexico" => [
                "fa" => "مکسیکو",
                "ps" => "مکسیکو",
            ],
            "Micronesia" => [
                "fa" => "میکرونزی",
                "ps" => "میکرونزی",
            ],
            "Moldova" => [
                "fa" => "مولداوی",
                "ps" => "مولداوی",
            ],
            "Monaco" => [
                "fa" => "موناكو",
                "ps" => "موناكو",
            ],
            "Mongolia" => [
                "fa" => "مغولستان",
                "ps" => "مغولستان",
            ],
            "Montenegro" => [
                "fa" => "مونته‌نگرو",
                "ps" => "مونته‌نگرو",
            ],
            "Morocco" => [
                "fa" => "مراکش",
                "ps" => "مراکش",
            ],
            "Mozambique" => [
                "fa" => "موزامبیک",
                "ps" => "موزامبیک",
            ],
            "Myanmar" => [
                "fa" => "میانمار",
                "ps" => "میانمار",
            ],
            "Namibia" => [
                "fa" => "نامیبیا",
                "ps" => "نامیبیا",
            ],
            "Nauru" => [
                "fa" => "ناورو",
                "ps" => "ناورو",
            ],
            "Nepal" => [
                "fa" => "نیپال",
                "ps" => "نیپال",
            ],
            "Netherlands" => [
                "fa" => "هلند",
                "ps" => "هلند",
            ],
            "New Zealand" => [
                "fa" => "نیوزیلند",
                "ps" => "نیوزیلند",
            ],
            "Nicaragua" => [
                "fa" => "نیکاراگوئه",
                "ps" => "نیکاراگوئه",
            ],
            "Niger" => [
                "fa" => "نیجر",
                "ps" => "نیجر",
            ],
            "Nigeria" => [
                "fa" => "نیجریا",
                "ps" => "نیجریا",
            ],
            "North Macedonia" => [
                "fa" => "مقدونیه شمالی",
                "ps" => "مقدونیه شمالی",
            ],
            "Norway" => [
                "fa" => "نروژ",
                "ps" => "نروژ",
            ],
            "Oman" => [
                "fa" => "عمان",
                "ps" => "عمان",
            ],
            "Pakistan" => [
                "fa" => "پاکستان",
                "ps" => "پاکستان",
            ],
            "Palau" => [
                "fa" => "پالائو",
                "ps" => "پالائو",
            ],
            "Palestine" => [
                "fa" => "فلسطین",
                "ps" => "فلسطین",
            ],
            "Panama" => [
                "fa" => "پاناما",
                "ps" => "پاناما",
            ],
            "Papua New Guinea" => [
                "fa" => "پاپوآ گینه نو",
                "ps" => "پاپوآ گینه نو",
            ],
            "Paraguay" => [
                "fa" => "پاراگوئه",
                "ps" => "پاراگوئه",
            ],
            "Peru" => [
                "fa" => "پرو",
                "ps" => "پرو",
            ],
            "Philippines" => [
                "fa" => "فیلیپین",
                "ps" => "فیلیپین",
            ],
            "Poland" => [
                "fa" => "لهستان",
                "ps" => "لهستان",
            ],
            "Portugal" => [
                "fa" => "پرتغال",
                "ps" => "پرتغال",
            ],
            "Qatar" => [
                "fa" => "قطر",
                "ps" => "قطر",
            ],
            "Romania" => [
                "fa" => "رومانی",
                "ps" => "رومانی",
            ],
            "Russia" => [
                "fa" => "روسیه",
                "ps" => "روسیه",
            ],
            "Rwanda" => [
                "fa" => "رواندا",
                "ps" => "رواندا",
            ],
            "Saint Kitts and Nevis" => [
                "fa" => "سنت کیتس و نویس",
                "ps" => "سنت کیتس و نویس",
            ],
            "Saint Lucia" => [
                "fa" => "سنت لوسیا",
                "ps" => "سنت لوسیا",
            ],
            "Saint Vincent and the Grenadines" => [
                "fa" => "سنت وینسنت و گرنادین",
                "ps" => "سنت وینسنت و گرنادین",
            ],
            "Samoa" => [
                "fa" => "ساموآ",
                "ps" => "ساموآ",
            ],
            "San Marino" => [
                "fa" => "سان مارینو",
                "ps" => "سان مارینو",
            ],
            "Sao Tome and Principe" => [
                "fa" => "سائوتومه و پرنسیپ",
                "ps" => "سائوتومه و پرنسیپ",
            ],
            "Saudi Arabia" => [
                "fa" => "عربستان سعودی",
                "ps" => "عربستان سعودی",
            ],
            "Senegal" => [
                "fa" => "سنگال",
                "ps" => "سنگال",
            ],
            "Serbia" => [
                "fa" => "صربستان",
                "ps" => "صربستان",
            ],
            "Seychelles" => [
                "fa" => "سیشل",
                "ps" => "سیشل",
            ],
            "Sierra Leone" => [
                "fa" => "سیرالئون",
                "ps" => "سیرالئون",
            ],
            "Singapore" => [
                "fa" => "سنگاپور",
                "ps" => "سنگاپور",
            ],
            "Slovakia" => [
                "fa" => "اسلواکی",
                "ps" => "اسلواکی",
            ],
            "Slovenia" => [
                "fa" => "اسلوونی",
                "ps" => "اسلوونی",
            ],
            "Solomon Islands" => [
                "fa" => "جزایر سلیمان",
                "ps" => "جزایر سلیمان",
            ],
            "Somalia" => [
                "fa" => "سومالی",
                "ps" => "سومالی",
            ],
            "South Africa" => [
                "fa" => "آفریقای جنوبی",
                "ps" => "آفریقای جنوبی",
            ],
            "South Korea" => [
                "fa" => "کره جنوبی",
                "ps" => "کره جنوبی",
            ],
            "South Sudan" => [
                "fa" => "جنوب سودان",
                "ps" => "جنوب سودان",
            ],
            "Spain" => [
                "fa" => "اسپانیا",
                "ps" => "اسپانیا",
            ],
            "Sri Lanka" => [
                "fa" => "سریلانکا",
                "ps" => "سریلانکا",
            ],
            "Sudan" => [
                "fa" => "سودان",
                "ps" => "سودان",
            ],
            "Suriname" => [
                "fa" => "سورینام",
                "ps" => "سورینام",
            ],
            "Sweden" => [
                "fa" => "سوئد",
                "ps" => "سوئد",
            ],
            "Switzerland" => [
                "fa" => "سویس",
                "ps" => "سویس",
            ],
            "Syria" => [
                "fa" => "سوریه",
                "ps" => "سوریه",
            ],
            "Tajikistan" => [
                "fa" => "تاجیکستان",
                "ps" => "تاجیکستان",
            ],
            "Tanzania" => [
                "fa" => "تانزانیا",
                "ps" => "تانزانیا",
            ],
            "Thailand" => [
                "fa" => "تایلند",
                "ps" => "تایلند",
            ],
            "Togo" => [
                "fa" => "توگو",
                "ps" => "توگو",
            ],
            "Tonga" => [
                "fa" => "تونگا",
                "ps" => "تونگا",
            ],
            "Trinidad and Tobago" => [
                "fa" => "ترینیداد و توباگو",
                "ps" => "ترینیداد و توباگو",
            ],
            "Tunisia" => [
                "fa" => "تونس",
                "ps" => "تونس",
            ],
            "Turkey" => [
                "fa" => "ترکیه",
                "ps" => "ترکیه",
            ],
            "Turkmenistan" => [
                "fa" => "ترکمنستان",
                "ps" => "ترکمنستان",
            ],
            "Tuvalu" => [
                "fa" => "تووالو",
                "ps" => "تووالو",
            ],
            "Uganda" => [
                "fa" => "اوگاندا",
                "ps" => "اوگاندا",
            ],
            "Ukraine" => [
                "fa" => "اوکراین",
                "ps" => "اوکراین",
            ],
            "United Arab Emirates" => [
                "fa" => "امارات متحده عربی",
                "ps" => "امارات متحده عربی",
            ],
            "United Kingdom" => [
                "fa" => "پادشاهی متحده",
                "ps" => "متحده ملک",
            ],
            "United States" => [
                "fa" => "ایالات متحده",
                "ps" => "متحده ایالات",
            ],
            "Uruguay" => [
                "fa" => "اورگوئه",
                "ps" => "اورگوئه",
            ],
            "Uzbekistan" => [
                "fa" => "ازبکستان",
                "ps" => "ازبکستان",
            ],
            "Vanuatu" => [
                "fa" => "وانواتو",
                "ps" => "وانواتو",
            ],
            "Vatican City" => [
                "fa" => "شهر واتیکان",
                "ps" => "شهر واتیکان",
            ],
            "Venezuela" => [
                "fa" => "ونزوئلا",
                "ps" => "ونزوئلا",
            ],
            "Vietnam" => [
                "fa" => "ویتنام",
                "ps" => "ویتنام",
            ],
            "Yemen" => [
                "fa" => "یمن",
                "ps" => "یمن",
            ],
            "Zambia" => [
                "fa" => "زامبیا",
                "ps" => "زامبیا",
            ],
            "Zimbabwe" => [
                "fa" => "زیمبابوه",
                "ps" => "زیمبابوه",
            ],
        ];

        foreach ($country as $name => $translations) {
            // Create the country record
            $cnt = Country::factory()->create([]);
            CountryTrans::create([
                'value' => $name,
                "language_name" => "en",
                "country_id" => $cnt->id
            ]);

            // Loop through translations (e.g., fa, ps)
            foreach ($translations as $key => $value) {
                // Check if this is the province section
                if ($key == 'provinces') {
                    foreach ($value as $provinceName => $provinceDetails) {
                        // Create a province for this country
                        $province = Province::factory()->create([
                            "country_id" => $cnt->id,  // Associate province with the created country
                        ]);
                        ProvinceTrans::create([
                            'value' => $provinceName,
                            "language_name" => "en",
                            "province_id" => $province->id
                        ]);

                        // Loop through the province's translations and districts
                        foreach ($provinceDetails as $provinceKey => $provinceValue) {
                            if ($provinceKey == 'District') {
                                foreach ($provinceValue as $districtName => $districtDetails) {
                                    // Create district for this province
                                    $district = District::factory()->create([
                                        "province_id" => $province->id,  // Associate district with the created province
                                    ]);
                                    DistrictTrans::create([
                                        'value' => $districtName,
                                        "language_name" => "en",
                                        "district_id" => $district->id
                                    ]);

                                    // Translate district details (e.g., fa, ps)
                                    foreach ($districtDetails as $language => $translation) {
                                        DistrictTrans::create([
                                            'value' => $translation,
                                            "language_name" => $language,
                                            "district_id" => $district->id
                                        ]);
                                    }
                                }
                            } else {
                                // Translate province details (e.g., fa, ps)
                                ProvinceTrans::create([
                                    'value' => $provinceValue,
                                    "language_name" => $provinceKey,
                                    "province_id" => $province->id
                                ]);
                            }
                        }
                    }
                } else {
                    // Translate country details (e.g., fa, ps)
                    CountryTrans::create([
                        'value' => $value,
                        "language_name" => $key,
                        "country_id" => $cnt->id
                    ]);
                }
            }
        }
    }
}
