<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta http-equiv="X-UA-Compatible" content="ie=edge">
  <title>Document</title>
</head>
<style>
  body{
    direction: rtl;
  }
  .min-logo{
    height: 70px;
    width: 70px;
    text-align: center;
    margin:0;
    padding: 0;
    margin-top:-40px;
  }
  .min-logo-div{
    width: 100%;
    text-align: center;
    margin: 0;
    padding: 0;
    


  }
  *{
    margin: 0;
    padding: 0;
  }
  .header-text{
    padding: 0;
    margin: 0;
  }
   .page {
        page-break-after: always;
        /* Add a page break after each pair of student cards */
    }
  .min-contents p{
    font-size:15px;

  }
  .content-text{

  }


  .irddirector{

    float: left;
    margin: 0;
    padding: 0;
  }

  .ngodirector{
    float: right;
        margin-right: -40px;
    padding: 0;
  }
     .sing-page {
        width: 100%;
        align-items: center;
        margin-top: 50px;
        padding-top: 50px;
        /* border:1px solid red; */


    }

    .ngodirector {
        padding: 0px;
        margin-top: 10px;
        /* margin-right:10px; */
        width: 50%;
        height: 50px;
        float: right;
    }
       .irddirector {
        padding: 0px;
        margin-top: 10px;
        /* margin-right:10px; */
        width: 50%;
        height: 50px;
        float: left;
    }

  
</style>
<body>

  <div class="min-logo-div">
        <img src="{{ storage_path('app/public/images/emart.png') }}" class="min-logo" alt="">

        <h4 class="header-text">د افغانستان اسلامي امارت</h4>
        <h4  class="header-text">د عامې روغتیا وزارت
      </h4>
        <h4 class="header-text">د غیر دولتي موسسو/ بنسټونو د ثبت سند
      </h4>
      <br>
      <h5 class="header-text"> ( {{ $register_number }} )  د راجستر ګڼه</h5>

  </div>
  
<div class="min-contents">

    <p class="content-text">

         د راجستر دا سند په ({{ $date_of_sign }}) نېټه لاسلیک شوی دی چې له عامې رواغتیا وزارت سره ({{ $ngo_name }}) مؤسسې د ثبت استازیتوب کوي.  دا سند د یادې مؤسسې د عدم مسؤلیت فورم (NOC) او یا هم هوکړه لیک (MOU) نه دی. ټولې غیرې دولتي مؤسسې باید له عامې روغتیا وزارت سره د هوکړه لیک تر لاسلیک مخکې د عدم مسؤلیت پانه ډکه او بشپړه کړي.


       

     </p>
  <p class="content-text">



  اد راجستر دا سند د اقتصاد وزارت د مؤسساتو د ثبت او راجستریشن سیستم بدیل نه دی او نه هم د کومې ځانګړې پروژې یا مؤسسې په غوښتنه چې د عامې روغتیا وزارت څخه د عدم مسؤلیت فورمې ته ضرورت ولري ترتیب شوی، بلکې د هغو مؤسساتو لپاره چې په افغانستان کې د روغتیايي خدمتونو په برخه کې فعالیت کوي ځينې اصول تعین کړي. د راجستر دا سند هر کال د عامې روغتیا وزارت او اړونده مؤسسې او اینجو تر منځ لاسلیک کیږي. 

  </p>
  <p class="contetn-text">
   نوم او د نوم لنډيز:  {{ $ngo_name  }} ({{ $abbr }})
  </p>
  <p class="content-text">
  په افغانستان کې د مرکزي دفتر دقیقه پته: 
    
   {{$address  }}

  </p>
  <p class="content-text">
  په افغانستان د مسؤل شخص نوم او د اوسېدو دقیقه پته:   <br>
    نوم:  {{ $director }} 
    <br>
    آدرس:{{ $director_address }}
  </p>
  <p class="content-text">
    آيمیل آدرس او د اړیکې شمېره : {{ $email }}  {{ $contact }}

      </p>
  <p class="content-text">
    د تاسیس/رامنځته کېدو ځای او نېټه:  {{ $establishment_date }} , {{ $place_of_establishment }}
  </p>
  <p class="content-text">
    په اقتصاد وزارت کې د راجستر ګڼه:  {{ $ministry_economy_no }}
  </p>
 
  <p class="content-text">
   د ادارې عمومې موخې: {{ $general_objective }}
  </p>
  <p class="content-text">
     په افغانستان کې د ادارې موخې: {{ $afganistan_objective }}
  </p>
  <p class="content-text">
    د ادارې رسالت :{{ $mission }}
  </p>
  <p class="content-text">
   د ادارې لید لوری: {{ $vission }}
  </p>

  <p class="content-text">
      <b>دغه راجستر دواړه لوري د یو لړ مادو په مراعاتولو مسؤلې ګڼي:</b>
      <br>
      1-	که چېرته د روغتیا په برخه کې د پروژې د تطبیق پر مهال د انجو لخوا کوم شکایت  شتون ونه لري، د راجستر دا سند د یو کال لپاره د اعتبار وړ دی.
        <br>
   2-	دا راجستر پاڼه د غیر دولتي مؤسساتو لپاره اجازه لیک او یا هم د عدم مسؤلیت فورم نه دی چې له مخې يې وکولی شي روغتیايي فعالیتونو تر سره او پروژې تطبیق کړي. ټولې غیر دولتي مؤسسې مکلفې دي چې د پروژې تر تطبیق وړاندې د عدم مسؤلیت فورم له عامې روغتیا وزارت څخه تر لاسه کړي او هم له عامې روغتیا وزارت سره هوکړه لیک لاسلیک کړي. 
        <br>
   3-	د پروژې تر تطبیق وړاندې اړونده غیر دولتي مؤسسه مکلفه ده چې د پروژې د انتخاب په برخه کې د عامې روغتیا وزارت مشوره تر لاسه او د پروژې تر پلي کولو وړاندې د عامې روغتیا وزارت سره هوکړه لیک لاسلیک کړي تر څو یې فعالیتونه قانوني بڼه خپله کړي، د هوکړه لیک نه لاسلیکول د مؤسسې سره د راجستر په برخه کې د ګډودۍ سبب کیږي او هم د مؤسسې راجستریشن دوباره تر نظر لاندې نیول کېږي.
        <br>
     4-	د راجستر د دې سند په اساس مؤسسه نشي کولی چې روغتیايي فعالیتونه تر سره کړي. د روغتیايي فعالیتونو د پیل لپاره باید اړونده مؤسسه له عامې روغتیا وزارت سره هوکړه لیک ولري.
        <br>
       5-	له عامې روغتیا وزارت څخه د عدم مسؤلیت فورم تر لاسه کولو او د هوکړه لیک تر لاسلیک وروسته اړونده مؤسسه کولی شي د اساسي روغتیايي خدمتونو (BPHS) او اساسي روغتوني خدمتونو (EPHS) ټولګو د منل شویو اجزاوو له مخې روغتیايي خدمتونه وړاندې کړي.
        <br>
     6-	کله چې یوه مؤسسه مستیقمه (Vertical) او یا هم د اساسي روغتیايي خدمتونو او اساسي روغتوني خدمتونو په یوه ځانګړې برخه کې پروژه تطیقوي، باید د عامې ورغتیا وزارت د مقام رسمي اجازه تر لاسه کړي. 
        <br>
      7-	انجو باید د عامې روغتیا وزارت ټولې پالیسۍ تطبیق کړي. 
      <br>
    8-	انجو باید د عامې روغتیا وزارت د ستندرد معلوماتي مدیریتي سیستم (HMIS) په اساس د خپل فعالیت راپور وړاندې کړي.

        <br>
       9-	انجو به د عامې روغتیا وزارت په مرکزي او ولایتي سطحه د همغږۍ په میکانیزمونو کې برخه اخلي.
        <br>
     10-	انجو به د غوښتنې له مخې د پروژې د مختلفو برخو لکه د کارکوونکو د ګمارنې، ګوښه کېدو، امتیازاتو او بودجې په اړه معلومات په خپل وخت د عامې روغتیا وزارت ته سپاري.
        <br>
        11-	انجو باید د ملي نظارت او ارزیابۍ سیستم سره چې د عامې روغتیا وزارت او درېیم بنسټ له لوري تر سره کیږي هم، نظره وي.
        <br>
      12-	د انجو کارکوونکي باید پروژه په مناسبه توګه او د سیمې د منل شوي فرهنګ له مخې پلې کړي. 
        <br>
        13-	انجو خپل کارکوونکي د تخصص او د پروژې د ضرورت په اساس په خپل تشکیل کې وګماري. 
        <br>
      14-	 د افغان کارمندانو د روزنې په برخه کې تر ارزونې وروسته د ضرورت په اساس به انجو په روزنه کې برخه واخلي.
        <br>
      15-	 د راجستر د فورم له مخې د عامې روغتیا وزارت د مؤسسې له پروژې او فعالیتونو څخه په هر وخت کې د نظارت او ارزوني حق لري. 
        <br>
       16-	د عامې روغتیا وزارت او اړونده مؤسسه د مساواتو، روڼتیا، تبعیض، قومي او جنسي نفوس او نور هغه  اړونده فکتورونه چې د ملي بودجې انکشاف(NDBN) سند او د روغتیا ملي ستراتیژۍ (NHS) په اصولو کې بیان شوي  په کلکه مرعاتوي. 
        <br>
        17-	 که څه هم د لېږد رالېږد په برخه کې به ستونزې هم ولري، ولې محرومو سیمو ته دې لومړیتوب ورکړل شي.
        <br>
       18-	 د عامې روغتیا وزارت او اړونده مؤسسه باید په دې نظر وي چې د چارو د همغږۍ، روڼتیا او مقابل درناوي له مخې ګډ کار وکړي.
        <br>
     19-	مخالفتونه دې د ولایتي روغتیايي همغږۍ کمېټې(PHCC) او یا په مرکز کې د عامې روغتیا وزارت د نماینده ګانو له لارې حل شي. د مخالفتونو  د حل او ارزیابی په موخه د عامې روغتیا وزارت د درېیم ګړې مرجع د ټاکلو صلاحیت له ځانه سره لري.
        <br>
      20-	 په داسې حال کې چې فعالیت له یادو مادو سره مطابقت ونه لري د عامې روغتیا وزارت په هر وخت کې د دې راجستر د لغوه کولو صلاحیت لري.

        <br>
        <b>
       21-	 اینجو د اسلامي امارت د اصولو او قوانینو په مرعاتولو مکلفه ده.
        </b>



  </p>

</div>
<div class="page"></div>

  
 

  <div class="sing-page">
     <div class="irddirector">
   د عامې روغتیا وزارت استازی
    <br>
   {{$ird_director}} 
   <br>
   د نړیوالو اړیکو، مرستو د همغږۍ او انسجام رئیس
    <br>
<br>
    <br>
  
    د لاسلیک ځای:................................
  </div>
  <div class="ngodirector">
د مؤسسې استازی
   <br>
   {{ $director }}
   <br>
   رئیس {{ $ngo_name }}
   <br>
<br>
    <br>
    د لاسلیک ځای
  :................................

  </div>
   
  </div>



  
</body>
</html>