<!DOCTYPE html>
<html lang="en">

<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta http-equiv="X-UA-Compatible" content="ie=edge">
  <title>Document</title>
</head>
<style>
  body {
    direction: rtl;
  }

  .min-logo {
    height: 70px;
    width: 70px;
    text-align: center;
    margin: 0;
    padding: 0;
    margin-top: -40px;
  }

  .min-logo-div {
    width: 100%;
    text-align: center;
    margin: 0;
    padding: 0;



  }

  * {
    margin: 0;
    padding: 0;
  }

  .header-text {
    padding: 0;
    margin: 0;
  }

  .page {
    page-break-after: always;
    /* Add a page break after each pair of student cards */
  }

  .min-contents p {
    font-size: 15px;

  }

  .content-text {}


  .irddirector {

    float: left;
    margin: 0;
    padding: 0;
  }

  .ngodirector {
    float: right;
    margin-right: -40px;
    padding: 0;
  }

  .sing-page {
    width: 100%;
    align-items: center;
    margin-top: 50px;
    padding-top: 50px;
    /* border:1px solid red; */


  }

  .ngodirector {
    padding: 0px;
    margin-top: 10px;
    /* margin-right:10px; */
    width: 50%;
    height: 50px;
    float: right;
  }

  .irddirector {
    padding: 0px;
    margin-top: 10px;
    /* margin-right:10px; */
    width: 50%;
    height: 50px;
    float: left;
  }
</style>

<body>

  <div class="min-logo-div">
    <img src="{{ storage_path('app/public/images/emart.png') }}" class="min-logo" alt="">

    <h4 class="header-text">امارت اسلامي افغانستان</h4>
    <h4 class="header-text">وزارت صحت عامه
    </h4>
    <h4 class="header-text">فورم راجستر موسسات
    </h4>
    <br>
    <h5 class="header-text"> ( {{ $register_number }} ) نمبر راجستر</h5>

  </div>

  <div class="min-contents">

    <p class="content-text">


      اين راجستريشن به تاريخ ({{ $date_of_sign }}) امضا گردیده که نماینده گی از راجستر موسسە ({{ $ngo_name }}) در وزارت صحت عامه را می کند. این سند نه تصدیق عدم اعتراض و نه هم
      تفاهم نامه میباشد. تمام موسسات غیردولتی باید حتماً تصدیق عدم اعتراض یا اجازه نامه را از وزارت
      صحت عامه قبل از تطبیق پروژه صحی خویش بدست آورند.

    </p>
    <p class="content-text">



      اين راجستر سيستم راجستريشن رسمي وزارت اقتصاد را تعويض ننموده و به هيچ يک از پيشنهاد کدام
      پروژه خاص که ضرورت به تائيد جداگانه رسمي وزارت صحت عامه را داشته باشد ارتباط نمي گيرد.
      هدف آن معين ساختن اصول عمده براي آن تعداد از موسسات که عرضه خدمات مراقبت صحي را در
      افغانستان پيش ميبرند ميباشد و لزم پنداشته ميشود تا اين راجستریشن در طي هر سال براي يکبار بين
      وزارت صحت عامه و نهاد مخاطب به امضا برسد.

    </p>
    <p class="contetn-text">
      اسم و مخفف اسم: {{ $ngo_name  }} ({{ $abbr }})
    </p>
    <p class="content-text">
      آدرس دفتر مرکزي در افغانستان:

      {{$address }}

    </p>
    <p class="content-text">
      اسم و آدرس شخص مسئول در افغانستان: <br>
      اسم: {{ $director }}
      <br>
      آدرس:{{ $director_address }}
    </p>
    <p class="content-text">
      آدرس ایمیل و نمبر تیلفون: {{ $email }} {{ $contact }}

    </p>
    <p class="content-text">
      تاریخ و محل تاسیس: {{ $establishment_date }} , {{ $place_of_establishment }}
    </p>
    <p class="content-text">
      نمبر راجستریشن وزارت اقتصاد: {{ $ministry_economy_no }}
    </p>

    <p class="content-text">
      اهداف عمومی سازمان: {{ $general_objective }}
    </p>
    <p class="content-text">
      اهداف سازمان در افغانستان: {{ $afganistan_objective }}
    </p>
    <p class="content-text">
      رسالت سازمان:{{ $mission }}
    </p>
    <p class="content-text">
      دیدگاه سازمان: {{ $vission }}
    </p>

    <p class="content-text">
      <b> این راجستریشن هردو جانب را در رعایت ماده های ذیل مسئول می داند:</b>
      <br>
      1-این راجستریشن برای مدت یکسال قابل اعتبار است درصورتیکه کدام شکایت از جانب NGO در تطبیق
      پروژه ها در بخش صحت صورت نگیرد.
      <br>
      2-این سند به عنوان اجازه نامه برای موسسات غیر دولتی که فعالیت های صحی خویش را انجام بدهند
      نمی باشد. تمام موسسات غیر دولتی جهت تطبیق پروژه صحی خویش حتماً باید قبل اجازه/تصدیق عدم
      اعتراض را از وزارت صحت عامه بدست آورند، و MOU را با وزارت صحت عامه امضاء نماید.
      <br>
      3-قبل از تطبیق پروژه مؤسسه مکلف می باشد تا در ساحه انتخاب با وزارت صحت عامه مشوره نماید و قبل
      از تطبیق تفاهم نامه را با وزارت صحت عامه امضا نموده تا ارایه خدمات جنبه قانونی کامل داشته باشد.

      <br>
      4-به اساس این راجستریشن انجو نمیتواند فعالیت صحی انجام دهد فعالیت صحی نیاز به عقد تفاهمنامه
      میان وزارت صحت عامه و انجو را دارد.
      <br>
      5-انجو مکلف است تا تمام جزئيات مندرج مجموعه خدمات اساسي صحي (BPHS)و مجموعه خدمات
      اساسي شفاخانه يی(EPHS) را بعد از اخذ NOC و امضاء تفاهمنامه با وزارت صحت عامه عرضه نمايد.
      <br>
      6- هرگاه یک انجو برنامه ویرتیکل(Vertical)یا مستقیم را تطبیق نماید یا بالی عناصر مشخص مجموعه
      خدمات اساسی صحی/مجموعه خدمات اساسی شفاخانه ای تمرکز می نماید، باید اجازه رسمی از رهبری وزارت
      صحت عامه را بدست آورد.
      <br>
      7- انجو تمام پاليسي های وزارت صحت عامه را تعقيب نمايد.
      8-انجو به اساس ستندرد و سیستم معلوماتی منجمنت صحت (HMIS)وزارت صحت عامه راپور خویش را
      تهيه بدارد.
      <br>
      9- انجو در هماهنگي میکانيزم وزارت صحت عامه به سطح مرکزی و ولیتی اشتراک نمايد.
      <br>
      10-ارايه معلومات پروژه ها بشمول استخدام و انفکاک کارمندان، درجه معاشات و بودجه به اسرع وقت و
      تقاضا به دسترس وزارت صحت عامه گذاشته شود.
      <br>
      11-انجو موافق باشد تا در سیستم نظارت ملی و ارزیابی که ذريعه وزارت صحت عامه و نهاد سومی اجرا
      می گردد اشتراک نمايد.
      <br>
      12-کارمندان انجو پروژه های خویش را به طریق مناسب فرهنگ قابل قبول تطبیق نمايند
      <br>
      13-انجو تعداد از کارمندان متخصص را به اساس شایستگی و ضرورت در تشکیل خویش خواهد داشت.
      <br>
      14-انجو در قمست آموزش کارمندان واجد شرایط افغان به اساس ارزیابی ضرورت آموزش آنها سهيم خواهند
      بود.
      <br>
      15- وزارت صحت عامه حق نظارت و ارزیابی فعالیت های پروژه انجو ها را در هر مقطع زمانی در جریان معیاد
      راجستریشن خواهد داشت.
      <br>
      16-وزارت صحت عامه و مرجع مقابل اصول مساوات، شفافیت و عدم تبعیض را در مطابقت به نفوذ قومی،
      جنسی و دیگر فکتور هایی که در انکشاف بودجه ملی(NDBN)و ستراتیژی ملی صحت (NHS)تصريح گردیده
      است رعایت خواهند کرد.
      <br>
      17- اگر چه از لحاظ لوژستیکی مشکلت را به بار هم آورند به ساحات کم خدمت شده اولویت داده می شود.
      <br>
      18- وزارت صحت عامه و مرجع مخاطب موافق خواهند بود تا با تشریک مساعی و شراکت شفاف و احترام
      متقابل یکجا کار نمايند.
      <br>
      19-اختلفات طی مجالس کمیته هماهنگی صحی وللیتی(PHCC)یا ذريعه نماینده گان مرکز وزارت صحت
      عامه حل و فصل می گردد. وزارت صحت عامه صلحیت تعيين مرجع سومی را جهت ارزیابی و حل مجدد
      هر اختلف خواهد داشت.
      <br>
      20- در صورت عدم مطابقت کار با ماده های تصريح شده فوق وزارت صحت عامه صلحیت فسخ این
      راجستریشن را در هر مقطع زمانی دارد.

      <br>
      <b>
        21- انجو مکلف است تا اصول و قوانین امارت اسلمی افغانستان را رعایت و عملی نماید.
      </b>



    </p>

  </div>
  <div class="page"></div>




  <div class="sing-page">
    <div class="irddirector">
      ز جانب وزارت صحت عامه
      <br>
      {{$ird_director}}
      <br>
      رئیس روابط بين الملل
      <br>
      <br>
      <br>

      محل امضاء و مهر:................................
    </div>
    <div class="ngodirector">
      از جانب انجو
      <br>
      {{ $director }}
      <br>
      رئیس {{ $ngo_name }}
      <br>
      <br>
      <br>
      مهر و امضاء
      :..................................

    </div>

  </div>




</body>

</html>